results/fabio-512-run02/003_fio/cmd_330.output
io_uring-reference: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=io_uring, iodepth=8
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666790726,
  "timestamp_ms" : 1666790726420,
  "time" : "Wed Oct 26 15:25:26 2022",
  "jobs" : [
    {
      "jobname" : "io_uring-reference",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring-reference",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "8",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "io_uring",
        "filename" : "/dev/nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1511606784,
        "io_kbytes" : 1476178,
        "bw_bytes" : 215912981,
        "bw" : 210852,
        "iops" : 421704.042280,
        "runtime" : 7001,
        "total_ios" : 2952350,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1333,
          "max" : 30808,
          "mean" : 1878.538164,
          "stddev" : 370.577820,
          "N" : 2952350
        },
        "clat_ns" : {
          "min" : 3927,
          "max" : 150492,
          "mean" : 16780.232220,
          "stddev" : 3545.257165,
          "N" : 2952357,
          "percentile" : {
            "1.000000" : 12736,
            "5.000000" : 13248,
            "10.000000" : 13760,
            "20.000000" : 15168,
            "30.000000" : 15808,
            "40.000000" : 16192,
            "50.000000" : 16512,
            "60.000000" : 16768,
            "70.000000" : 17024,
            "80.000000" : 17536,
            "90.000000" : 18048,
            "95.000000" : 18816,
            "99.000000" : 33024,
            "99.500000" : 35072,
            "99.900000" : 50944,
            "99.950000" : 67072,
            "99.990000" : 78336
          }
        },
        "lat_ns" : {
          "min" : 7194,
          "max" : 151965,
          "mean" : 18658.769599,
          "stddev" : 3523.940859,
          "N" : 2952357
        },
        "bw_min" : 208714,
        "bw_max" : 212848,
        "bw_agg" : 100.000000,
        "bw_mean" : 210911.285714,
        "bw_dev" : 1029.007022,
        "bw_samples" : 14,
        "iops_min" : 417428,
        "iops_max" : 425697,
        "iops_mean" : 421822.500000,
        "iops_stddev" : 2058.121277,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 15.842857,
      "sys_cpu" : 81.442857,
      "ctx" : 15090,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 100.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999966,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.010000,
        "10" : 0.087591,
        "20" : 95.854726,
        "50" : 3.952004,
        "100" : 0.104730,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "nvme0n1",
      "read_ios" : 4279306,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 24601,
      "write_ticks" : 0,
      "in_queue" : 24601,
      "util" : 99.069123
    }
  ]
}

io_uring-reference: (groupid=0, jobs=1): err= 0: pid=10583: Wed Oct 26 15:25:26 2022
  read: IOPS=422k, BW=206MiB/s (216MB/s)(1442MiB/7001msec)
    slat (nsec): min=1333, max=30808, avg=1878.54, stdev=370.58
    clat (usec): min=3, max=150, avg=16.78, stdev= 3.55
     lat (usec): min=7, max=151, avg=18.66, stdev= 3.52
    clat percentiles (nsec):
     |  1.00th=[12736],  5.00th=[13248], 10.00th=[13760], 20.00th=[15168],
     | 30.00th=[15808], 40.00th=[16192], 50.00th=[16512], 60.00th=[16768],
     | 70.00th=[17024], 80.00th=[17536], 90.00th=[18048], 95.00th=[18816],
     | 99.00th=[33024], 99.50th=[35072], 99.90th=[50944], 99.95th=[67072],
     | 99.99th=[78336]
   bw (  KiB/s): min=208714, max=212848, per=100.00%, avg=210911.29, stdev=1029.01, samples=14
   iops        : min=417428, max=425697, avg=421822.50, stdev=2058.12, samples=14
  lat (usec)   : 4=0.01%, 10=0.09%, 20=95.85%, 50=3.95%, 100=0.10%
  lat (usec)   : 250=0.01%
  cpu          : usr=15.84%, sys=81.44%, ctx=15090, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2952350,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=206MiB/s (216MB/s), 206MiB/s-206MiB/s (216MB/s-216MB/s), io=1442MiB (1512MB), run=7001-7001msec

Disk stats (read/write):
  nvme0n1: ios=4279306/0, merge=0/0, ticks=24601/0, in_queue=24601, util=99.07%